# 'Age': ['12', '18+', '16+', '16+', '18+', '16+', '18+', '12', '7', '18+'] 

# нужно создать dataFrame и реализовать аналог value_couts

# строковые данные (категории)

# частоты (сколько фильмов каждого возраста)

df <- data.frame(
  Age = c('12', '18+', '16+', '16+', '18+', '16+', '18+', '12', '7', '18+')
)

print(df)

# структура
str(df)

# аналог value_counts из ipynb нужно реализовать

# нужно реализовать логику в R
# ? количество появленией каждого уникального элемента в колонке Age
# метод table
age_couts <- table(df$Age)

# sort ... параметр decreasing = TRUE (сортировка по убыванию)

# sort ???

age_couts <- sort( age_couts , decreasing = TRUE)

# _________________________

# 1) вывести идексные значения 
# names
print(names(age_couts))
# 2) вывести значения частот 
# as.vector
print(as.vector(age_couts))


#________________
# визуализируем # barplor (столбчатая диаграмма)

barplot(age_couts,
        col = "blue",
        main = "Распределение по категориям",
        xlab = "Индекс категорий возраста",
        ylab = "Частота",
        border = "black")

